doc/html/upgrade2.3.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Upgrading to Nitrogen 2.3</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="Upgrading to Nitrogen 2.3"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2015-01-29 17:28:06 CST"/>
<meta name="author" content="Jesse Gumm (@jessegumm)"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<LINK href="stylesheet.css" rel="stylesheet" type="text/css" />

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Upgrading to Nitrogen 2.3</h1>

<p><a href="http://nitrogenproject.com">Home</a> | <a href="./index.html">Getting Started</a> | <a href="./api.html">API</a> | <a href="./elements.html">Elements</a> | <a href="./actions.html">Actions</a> | <a href="./validators.html">Validators</a> | <a href="./handlers.html">Handlers</a> | <a href="./config.html">Configuration Options</a> | <a href="../plugins.html">Plugins</a> | <a href="./jquery_mobile_integration.html">Mobile</a> | <a href="./troubleshooting.html">Troubleshooting</a> | <a href="./about.html">About</a>
</p>


<div class=headline>Upgrading to Nitrogen 2.3</div>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Overview</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Overview</h2>
<div class="outline-text-2" id="text-1">


<p>
  Upgrading to Nitrogen 2.3 is simple, however, ensuring that your upgraded app
  supports Websockets will require a small amount of work (mostly copying a few
  files, and checking simple configurations).
</p>

</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3"></span> The Simple Method (which won't allow the use of Websockets)</h3>
<div class="outline-text-3" id="text-1-1">


<p>
   Nitrogen 2.3 is designed to be completely backwards compatible with Nitrogen
   2.2 and earlier, meaning no changes to your existing codebase should be
   required (beyond recompiling your modules to support any changes to header
   files).
</p>
<p>
   If downtime is acceptable, you can do the following after bringing down your
   Erlang VM.
</p>
<p>
   To upgrade to Nitrogen 2.3, you'll want to update your rebar.config and
   change the <code>nitrogen_core</code> appliation to use the "v2.3.0" tag, and update
   the <code>simple_bridge</code> application to use the "v2.0.0" tag:
</p>



<pre class="src src-erlang">{nitrogen_core, <span class="org-string">""</span>, {git, <span class="org-string">"git://github.com/nitrogen/nitrogen_core"</span>, {tag, <span class="org-string">"v2.3.0"</span>}}},
{simple_bridge, <span class="org-string">""</span>, {git, <span class="org-string">"git://github.com/nitrogen/simple_bridge"</span>, {tag, <span class="org-string">"v2.0.0"</span>}}},
</pre>


<p>  
   Then run <code>make upgrade</code> in your app, which should fetch the latest versions
   and recompile your app accordingly.
</p>
<p>
   Your application will then be upgraded.
</p>
</div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3"></span> Upgrading with Sync</h3>
<div class="outline-text-3" id="text-1-2">


<p>
   If you wanted, you can enable sync, either with <code>bin/dev compile</code> (at the
   *nix terminal) or with <code>sync:go()</code> (at the Erlang Shell).
</p>
<p>
   Then run the above instructions for upgrading. Depending on the size of your
   application, you may experience a little bit of downtime while your Nitrogen
   installation is recompiling, but as soon as its finished, Sync will load the
   modules and you'll be good to go.
</p>
</div>

</div>

<div id="outline-container-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3"></span> The Simple Method with Sync and without any Downtime</h3>
<div class="outline-text-3" id="text-1-3">


<p>
   If you want to ensure you don't experience any downtime during this upgrade,
   you're going to want to upgrade your <code>sync</code> version first.
</p>
<p>
   The easiest way to do this is to first start <code>sync</code> in your Nitrogen
   application, either with <code>sync:go()</code> or at the Linux/Unix terminal with
   <code>bin/dev compile</code>.
</p>
<p>
   Then we're going to manually upgrade sync:
</p>



<pre class="src src-bash">$ cd lib/sync
$ git checkout master
$ git pull origin master
</pre>


<p>
   That second line is just to make sure we're actually on the master branch.
   Previous versions of Nitrogen had an issue that might have caused us to be
   on a detached branch, this will ensure we're good to go.
</p>
<p>  
   After running that command, sync very likely would have crashed. That's
   okay: it's supervised, so it would be restarted with a fresh state.
</p>
<p>
   Now that sync is upgraded, we're going to want to pause it:
</p>
<p>
   At the Erlang console, run:
</p>



<pre class="src src-erlang">&gt; <span class="org-type">sync</span>:<span class="org-type">pause</span>().
</pre>


<p>
   Now let's unpause sync:
</p>



<pre class="src src-erlang">&gt; <span class="org-type">sync</span>:<span class="org-type">unpause</span>().
</pre>


<p>
   This should start a whole slew of things going on in the erlang VM,
   scrolling really fast (just notifying you of updated BEAM files), and when
   it's finished, your application will be upgraded and live with no downtime.
</p>
</div>

</div>

<div id="outline-container-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3"></span> The More Complete Method</h3>
<div class="outline-text-3" id="text-1-4">


<p>
   The previous instructions were okay as long as you don't care about
   Websockets.
</p>
<p>
   If you want to use websockets, however, it's going to take a little bit more
   work.
</p>
<p>
   Please note that these instructions will require a bit of downtime because
   we'll have to take the underlying server offline to be restarted by
   SimpleBridge.  In this case, we may as well stop <code>sync</code> before doing this
   process.
</p>
<p>
   Same as above, we're going to need to add the same rebar dependencies:
</p>



<pre class="src src-erlang">{nitrogen_core, <span class="org-string">""</span>, {git, <span class="org-string">"git://github.com/nitrogen/nitrogen_core"</span>, {tag, <span class="org-string">"v2.3.0"</span>}}},
{simple_bridge, <span class="org-string">""</span>, {git, <span class="org-string">"git://github.com/nitrogen/simple_bridge"</span>, {tag, <span class="org-string">"v2.0.0"</span>}}},
</pre>


<p>
   Then run <code>make upgrade</code>.
</p>
<p>
   Now we're going to need to download a few files. Feel free to copy and paste
   the following into your *nix shell:
</p>



<pre class="src src-bash">$ curl https://raw.githubusercontent.com/nitrogen/nitrogen/master/rel/overlay/common/site/src/nitrogen_main_handler.erl -o site/src/nitrogen_main_handler.erl
$ curl https://raw.githubusercontent.com/nitrogen/nitrogen/master/rel/overlay/common/site/src/nitrogen_sup.erl -o site/src/nitrogen_sup.erl
$ curl https://raw.githubusercontent.com/nitrogen/nitrogen/master/rel/overlay/common/etc/simple_bridge.config -o etc/simple_bridge.config
</pre>


<p>
   Notice that the second line will actually overwrite the current
   <code>nitrogen_sup.erl</code> file, so if you have anything customized there, make note
   of it or make a backup first.
</p>
<p>
   Now you'll want to copy any custom handlers and other configs you've
   manually added to <code>site/src/nitrogen_PLATFORM.erl</code> into
   <code>site/src/nitrogen_main_handler.erl</code> before into the <code>handlers()</code> function.
   This will ensure that your custom handlers get initialized with both
   standard requests and websocket requests.
</p>
<p>
   So if your <code>nitrogen_mochiweb.erl</code> file looked like this:
</p>



<pre class="src src-erlang"><span class="org-preprocessor">-module</span>(nitrogen_mochiweb).
<span class="org-preprocessor">-export</span> ([<span class="org-type">loop/1</span>]).
<span class="org-preprocessor">-include_lib</span>(<span class="org-string">"nitrogen_core/include/wf.hrl"</span>).

<span class="org-erlang-font-lock-exported-function-name">loop</span>(<span class="org-variable-name">Req</span>) -&gt;
    {ok, <span class="org-variable-name">DocRoot</span>} = <span class="org-type">application</span>:<span class="org-type">get_env</span>(mochiweb, document_root),
    <span class="org-variable-name">RequestBridge</span> = <span class="org-type">simple_bridge</span>:<span class="org-type">make_request</span>(mochiweb_request_bridge, {<span class="org-variable-name">Req</span>, <span class="org-variable-name">DocRoot</span>}),
    <span class="org-variable-name">ResponseBridge</span> = <span class="org-type">simple_bridge</span>:<span class="org-type">make_response</span>(mochiweb_response_bridge, {<span class="org-variable-name">Req</span>, <span class="org-variable-name">DocRoot</span>}),
    <span class="org-type">nitrogen</span>:<span class="org-type">init_request</span>(<span class="org-variable-name">RequestBridge</span>, <span class="org-variable-name">ResponseBridge</span>),
    <span class="org-type">wf</span>:<span class="org-type">header</span>(<span class="org-string">'cache-control'</span>,<span class="org-string">"no-cache"</span>),
    <span class="org-type">wf</span>:<span class="org-type">content_type</span>(<span class="org-string">"text/html; charset=utf-8"</span>),
    <span class="org-type">nitrogen</span>:<span class="org-type">handler</span>(myapp_security_handler,[]),
    <span class="org-type">nitrogen</span>:<span class="org-type">handler</span>(myapp_route_handler, []),
    <span class="org-type">nitrogen</span>:<span class="org-type">run</span>().
</pre>


<p>
   Then we're going to want our <code>nitrogen_main_handler.erl</code> file to look like this:
</p>



<pre class="src src-erlang"><span class="org-preprocessor">-module</span>(nitrogen_main_handler).
   -<span class="org-type">export</span>([<span class="org-type">run/0</span>]).

   <span class="org-type">handlers</span>() -&gt;
       <span class="org-type">nitrogen</span>:<span class="org-type">handler</span>(myapp_security_handler,[]),
       <span class="org-type">nitrogen</span>:<span class="org-type">handler</span>(myapp_route_handler, []),

   <span class="org-type">ws_init</span>() -&gt;
      <span class="org-type">handlers</span>(),
      ok.

   <span class="org-type">run</span>() -&gt;
       <span class="org-type">wf</span>:<span class="org-type">header</span>(<span class="org-string">'cache-control'</span>,<span class="org-string">"no-cache"</span>),
       <span class="org-type">wf</span>:<span class="org-type">content_type</span>(<span class="org-string">"text/html; charset=utf-8"</span>),
       <span class="org-type">handlers</span>(),
       <span class="org-type">wf_core</span>:<span class="org-type">run</span>().
</pre>


<p>
   You'll notice above that we don't set the header or content type in the
   <code>ws_init()</code> function. This is because the headers would have already been
   sent when the websocket connection is established.
</p>
<p>
   Next, we're going to edit <code>etc/simple_bridge.config</code> to make sure we're
   binding to the correct IP address and ports and that those settings are all
   correct (static paths, max post post and file sizes, etc).
</p>
<p>
   At this point, we can safely remove your <code>site/PLATFORM.config</code> file and
   your old <code>site/src/nitrogen_PLATFORM.erl</code> file (where <code>PLATFORM</code> is your
   server of choice).
</p>
<p>
   From here, you can run a simple <code>make upgrade</code>, and your application will be
   upgraded.
</p>
<p>
   Go ahead and kill the Erlang VM and restart it and it should be good to go,
   complete with websocket support.
</p>
</div>

</div>

<div id="outline-container-1-5" class="outline-3">
<h3 id="sec-1-5"><span class="section-number-3"></span> A Note about Nginx and Reverse Proxies</h3>
<div class="outline-text-3" id="text-1-5">


<p>
   If you are using Nginx as a reverse proxy for Nitrogen, and if you wish to
   support Websockets, you're going to need to be running at least version 1.4
   of Nginx.
</p></div>
</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2015-01-29 17:28:06 CST</p>
<p class="author">Author: Jesse Gumm (@jessegumm)</p>
<p class="creator">Org version 7.8.02 with Emacs version 23</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div><h2>Comments</h2>
<b>Note:</b><!-- Disqus does not currently support Erlang for its syntax highlighting, so t-->To specify <!--Erlang--> code blocks, just use the generic code block syntax: <pre><b>&lt;pre&gt;&lt;code&gt;your code here&lt;/code&gt;&lt;/pre&gt;</b></pre>
<br />
<br />
<div id="disqus_thread"></div>
<script type="text/javascript">
	/* * * CONFIGURATION VARIABLES: EDIT BEFORE PASTING INTO YOUR WEBPAGE * * */
	var disqus_shortname = 'nitrogenproject'; // required: replace example with your forum shortname
	var disqus_identifier = 'html/upgrade2.3.html'; //This will be replaced with the path part of the url

	/* * * DON'T EDIT BELOW THIS LINE * * */
	(function() {
		var dsq = document.createElement('script'); dsq.type = 'text/javascript'; dsq.async = true;
		dsq.src = 'http://' + disqus_shortname + '.disqus.com/embed.js';
		(document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
	})();
</script>
<noscript>Please enable JavaScript to view the <a href="http://disqus.com/?ref_noscript">comments powered by Disqus.</a></noscript>
<a href="http://disqus.com" class="dsq-brlink">comments powered by <span class="logo-disqus">Disqus</span></a>
</body>
</html>
